//Задача 2: Да се състави програма,
//която изчислява сумата от цифрите на
//всички естествени 2-цифрени числа до въведено от клавиатурата
//на число.
//Входни данни: n - естествено 2-цифрено число
//от интервала [10..99].
//Пример: 21
//Изход: 60
#include<iostream>
using namespace std;
int main()
{
    int n, sum = 0, a, b;
    cin>>n;
    for(int i = 10; i <= n; i++)
    {
        a = i % 10;
        b = i / 10 % 10;
        sum = sum + a + b;
    }
    cout<<sum;
    return 0;
}
