#include <iostream> 
using namespace std; 

int main() 
{
    int i, j; // Декларираме си броячи i и j
    char alph = 'A'; // Декларираме и инициализираме променлива alph, с която ще принтираме буквите
    int n, blk; // Декларираме променливи за брой редове n и брой интервали blk
    int ctr = 1; // Инициализираме променлива ctr, в която пазим колко пъти трябва да принтираме alph

    cin >> n; // Въвеждаме брой редове

    for (i = 1; i <= n; i++) // Циклим по редовете
    {
        for (blk = 1; blk <= n - i; blk++) // Цикъл за принтиране на интервалите преди буквите
            cout << "  "; 

        for (j = 0; j <= (ctr / 2); j++) // Цикъл за принтиране на буквите в нарастващ ред, т.е. A, B, C, D,...
        {
            cout << alph++ << " "; // Принтираме буквата и увеличаваме alph с 1, за да стигнем до следващата буква
        }

        alph = alph - 2; // Стигнали сме средата на текущия ред, затова намаляваме alph с 2 и почваме да принтираме в обратен ред буквите
        for (j = 0; j < (ctr / 2); j++) // Цикъл за принтиране на буквите в намаляващ ред, т.е. ... D, C, B, A
        {
            cout << alph-- << " "; // Принтираме буквата и намаляваме alph с 1, за да стигнем до предишната буква в азбуката
        }

        ctr = ctr + 2; // Имаме интервали между всяка една буква и по 2 нови букви на всеки нов ред -> затова броя пъти, които ще трябва да принтираме буквите се увеличава с 2 на всеки ред
        alph = 'A'; // "Нулираме" alph, за да започнем да принтираме отново от A 
        cout << endl; // Накрая принтираме нов ред и изпълняваме тялото на цикъла отново
    }
    return 0;
}

