#include <iostream> 
using namespace std; 

int main() 
{
    int i, j, n; // Декларираме броячи i, j и променлива за броя редове - n

    cin >> n; // Въвеждаме брой редове

    for (i = n; i >= 1; i--) // Цикъл за обхождане на редовете в обратен ред, т.е. започваме от n и приключваме на 1
    {
        /* Цикъл за принтиране на интервали преди цифрите */
        for (j = 1; j <= n + 5 - i; j++) // Тук 5-цата е чисто за форматиране, т.е. не е нужно да е 5 места навътре картинката
            cout << " "; 

        /* Принтираме числата във възходящ ред до средата на реда */
        for (j = 1; j <= i; j++) // Цикъл за тази цел - средата на реда е равна на i, затова циклим до <= i
            cout << j; // Броячът j е самото число 

        /* Принтираме същите числа, но в обратен ред и без самото i */
        for (j = i - 1; j >= 1; j--) // Цикъл за тази цел - започва от предишното число преди i и завършва с 1
            cout << j; // Броячът j е самото число

        cout << endl; // Преминаваме на следващия ред 
    }
    return 0;
}
