#include<iostream>
using namespace std;
/*
Задача 3: Да се напише програма, която отпечатва
на екрана всички числа не по-големи от 300,
като започва от 100 и всяко следващо е със 7
по-голямо от предишното. Числата да се разполагат
на един ред, разделени с по 2 интервала.
*/
int main()
{
    for(int i = 100; i <= 300; i = i + 7) /// i+=7
    {
        cout<<i<<"  ";
    }
    cout<<endl;
    for(int i = 100; i <= 300; i++)
    {
        if(i % 7 == 2)
        {
            cout<<i<<"  ";
        }
    }
    return 0;
}
