#include<iostream>
using namespace std;
/*
1. Дадени са две цели числа: A, B.
Ако техните стойности не са равни, то да се присвои на
всяка променлива сумата от техните стойности,
а ако са равни, то да се присвои на променливите нулева стойност.
Да се изведат новите им стойности.
*/
int main()
{
    int A, B;
    cin>>A>>B;

    /// >, < - по-голямо, по-малко
    /// >=, =< - по-голямо или равно, по-малко или равно
    /// == - проверяваме равенство
    /// != - проверяваме неравенство
    /// ! - отрицание
    /// || - или
    /// && - и

    if(A != B) /// if(!(A == B))
    {
        A = A + B;
        B = A;
    }
    else
    {
        A = 0;
        B = A;
    }

    cout<<A<<" "<<B;

    return 0;
}
