#include<iostream>
using namespace std;

/*
1.	Млад моряк се учи да снема данни за
местоположение на кораба.
Да се състави програма, чрез която по
въведено естествено число
от интервала [0..3600] се извежда съобщение
дали данните са коректни.
Използвайте проверка на логическо условие
- оператор if.
Реалните данни са между 60 и 120 градуса,
но за програмата следим само <180 градуса.
Пример: 90
Изход: Да
*/

int main()
{
    int a;
    cin>>a;
    bool b=(a>=60 && a<=180);
    if(b)
    {
        cout<<"YES";
    }
    else{
        cout<<"NO";
    }
    /*
    if(a>=60 && a<=180)
    {
        b=1;
    }
    else
    {
        b=0;
    }
    if(b)
    {
        cout<<"YES";
    }
    else
    {
        cout<<"NO";
    }*/
    return 0;
}


