#include<iostream>
using namespace std;

/*
2.	Да се състави програма, чрез която се въвеждат от клавиатурата
3 числа от интервала [-99.99 .. 99.99]. Програмата да извежда
въведените числа във възходящ ред на стойностите им.
Използвайте проверка на логическо условие - оператор if.
Пример: 3.14, -2.73, 1.25
Изход: -2.73, 1.25, 3.14.
*/

int main()
{
    double a, b, c;
    cin >> a >> b >> c;
    if(a > b && a > c && b > c){
        cout << a << " " << b << " " << c;
    }else if(a > b && a > c && c > b){
        cout << a << " " << c << " " << b;
    }else if(b > a && b > c && a > c){
        cout << b << " " << a << " " << c;
    }else if(b > a && b > c && c > a){
        cout << b << " " << c << " " << a;
    }else if(c > a && c > b && a > b){
        cout << c << " " << a << " " << b;
    }else if(c > a && c > b && b > a){
        cout << c << " " << b << " " << a;
    }else{
        cout << "opa";
    }

    return 0;
}
