#include <iostream> 
using namespace std; 

int main() 
{
    int i, j, n, p, q; // Декларираме броячи i, j и променливите n - брой редове, p, q - променливи, които служат за редуването на 0 и 1

    cin >> n; // Въвеждаме брой редове

    // Идеята е да принтираме триъгълник, чиито редове започват с редуващи се 0 и 1
    for (i = 1; i <= n; i++) // Цикъл по редовете
    {
        if (i % 2 == 0) // Проверяваме дали текущият ред е четен
        {
            p = 1; // Започваме с 1 
            q = 0; // Следва 0
        }
        else // Проверяваме дали текущият ред е нечетен
        {
            p = 0; // Започваме с 0
            q = 1; // Следва 1
        }

        for (j = 1; j <= i; j++) // Цикъл, с който принтираме всички числа по редовете -> колкото ни е индексът на реда, толкова цифри ще имаме на този ред
        {
            if (j % 2 == 0) // Проверяваме за четна позиция
                cout << p; // Принтираме p, ако е четна 
            else
                cout << q; // Принтираме q, ако е нечетна
        }

        cout << endl; // Преминаваме на следващия ред
    }
    return 0;
}
