#include<iostream>
using namespace std;

/*
3.	Да се състави програма, чрез която се въвежда 4-цифренo
естествено число от интервала [1000.. 9999].
От това число се формират 2 нови 2-цифрени числа.
Първото число се формира от 1-та и 4-та цифра на въведеното число.
Второто число се формира от 2-рa - 3-та цифра на въведеното число.
На екрана да се изведе дали 1-то ново число e по-малко <, равно =
или по-голямо от 2-то число.
Използвайте проверка на логическо условие - оператор if.
Пример: 3332 Изход: по-малко (32<33)
Пример: 1144 Изход: равни (14=14)
Пример: 9875 Изход: по-голямо (95>87)
*/

int main()
{
    int A, a, b, c, d, B, C;
    cin >> A;
    a = A / 1000;
    b = A / 100 % 10;
    c = A / 10 % 10;
    d = A % 10;
    B = 10 * a + d;
    C = 10 * b + c;
    if(B > C) cout << B;
    else if(B == C) cout << "ravni";
    else cout << C;
    return 0;
}
