#include<iostream>
using namespace std;
/*
4. Дадени са три реални променливи: A, B, C.
Ако са подредени в нарастващ ред,
то да се удвоят; в противен случай
да се замени стойността на всяка променлива
с противоположната стойност.
Да се изведат новите стойности на A, B, C.
*/
int main()
{
    double A,B,C;
    cin>>A>>B>>C;
    if(A < B && B < C) /// A < B < C
    {
        A = A * 2;
        B = B * 2;
        C = C * 2;
    }
    else
    {
        A = A * (-1);
        B = B * (-1);
        C = C * (-1);
    }
    cout<<A<<" "<<B<<" "<<C;
    return 0;
}
