#include<iostream>
using namespace std;
/*
Задача 2: Да се напише програма, която
отпечатва на екрана всички числа между 30 и 50
включително, като се движи от големите към
малките и всяко число се отпечатва на нов ред.
*/
int main()
{
    for(int i = 50; i >= 30; i--)
    {
        cout<<i<<endl; /// '\n'
    }

    return 0;
}

